taylortrimble/pic18usb/USBFramework.c
rom const unsigned char _USBDeviceStringDescriptor[] = {
    0x44,               // bLength
    STRING,             // bDescriptorType
    'E', 0x00, 'N', 0x00, 'G', 0x00, 'R', 0x00, ' ', 0x00, '2', 0x00, '2', 0x00, '1', 0x00, '0', 0x00, ' ', 0x00,
    'P', 0x00, 'I', 0x00, 'C', 0x00, '1', 0x00, '8', 0x00, 'F', 0x00, '2', 0x00, '4', 0x00, '5', 0x00, '5', 0x00, ' ', 0x00,
    'U', 0x00, 'S', 0x00, 'B', 0x00, ' ', 0x00,
    'F', 0x00, 'i', 0x00, 'r', 0x00, 'm', 0x00, 'w', 0x00, 'a', 0x00, 'r', 0x00, 'e', 0x00
};

rom const rom const unsigned char *_USBStringDescriptors[] = {
    _USBLangIDStringDescriptor,
    _USBManufacturerStringDescriptor,
    _USBDeviceStringDescriptor
};

#pragma code
void HighPriorityISR(void);
void LowPriorityISR(void);
USBTransaction _USBGetCurrentTransaction(void);
void _USBHandleControlError(void);
void _USBResetEP0InBuffer(void);
void _USBWriteValue(unsigned value, unsigned char bytes);
void _USBSendDescriptor(void);
void _USBWriteDescriptor(rom const unsigned char *descriptor, unsigned char bytes);
void _USBWriteSingleDescriptor(rom const unsigned char *descriptor);
void _USBProcessEP0(void);
void _USBEngineReset(void);
void _USBConfigureBufferDescriptors(void);
void _USBSetup(void);
void InitUSB(void);
void ServiceUSB(void);

// Interrupt service routines
#pragma code __HIGH_PRIORITY_ISR__=0x0008
void _high_priority_isr(void) {_asm goto HighPriorityISR _endasm}
#pragma code __LOW_PRIORITY_ISR__=0x0018
void _low_priority_isr(void) {_asm goto LowPriorityISR _endasm}

#pragma interrupt HighPriorityISR
void HighPriorityISR(void)
{
    // High interrupt service routine
}

#pragma interruptlow LowPriorityISR
void LowPriorityISR(void)
{
    // Low interrupt service routine
}

USBTransaction _USBGetCurrentTransaction(void)
{
    USBTransaction transaction;
    USBBufferDescriptor *bd;

    bd = (USBBufferDescriptor *)(0x200+USTAT);
    transaction.USTAT = USTAT;
    transaction.endpoint = (USTAT&0x38)>>3;     // Transaction endpoint is recorded in USTAT<5:3>
    transaction.token = bd->status >> 2;        // Transaction PID is recorded in BDnSTAT<5:2>
    transaction.bd = bd;                        // Point to the USB SIE buffer descriptor

    return transaction;
}

void _USBHandleControlError(void)
{
    // Reset EP0 OUT buffer capacity
    _USBBD0O.count = EP0_SIZE;

    // Stall endpoint 0
    _USBBD0O.status = (UOWN|BSTALL);
    _USBBD0I.status = (UOWN|BSTALL);
}

void _USBResetEP0InBuffer(void)
{
    _USBBD0I.count = 0;                    // Not sending a byte
    _USBBD0I.status = (UOWN|DTS|DTSEN);    // Set UOWN, send byte as DATA1
}

void _USBWriteValue(unsigned value, unsigned char bytes)
{
    unsigned char index;

    // Copy value to EP0 IN buffer 8bits at a time
    for (index = 0; index < bytes; index++) {
        _USBBD0I.address[index] = (value>>(index*8))&0x00FF;
    }

    // Return data to SIE through buffer descriptor
    _USBBD0I.count = bytes;
    _USBBD0I.status = (UOWN|DTS|DTSEN);    // Set UOWN, send as DATA1
}

void _USBSendDescriptor(void)
{
    unsigned char index;

    if (_USBDescriptorBytesLeft <= EP0_SIZE) {
        // Copy remaining bytes to EP0 IN buffer
        for (index = 0; index < _USBDescriptorBytesLeft; index++) {
            _USBBD0I.address[index] = *_USBDescriptorToSend++;
        }

        // Return data to SIE through buffer descriptor
        _USBBD0I.count = _USBDescriptorBytesLeft;
        _USBBD0I.status = _USBBD0I.status^DTS;                // Toggle the DATAx bit
        _USBBD0I.status = (_USBBD0I.status&DTS)|(UOWN|DTSEN); // Preserve DATAx, clear rest, set UOWN and DTSEN

        // Not sending a descriptor any more
        _USBEngineStatus &= ~USBEngineStatusSendingDescriptor;
        _USBDescriptorBytesLeft = 0;
    } else {
        // Copy a full length of bytes to EP0 IN buffer
        for (index = 0; index < EP0_SIZE; index++) {
            _USBBD0I.address[index] = *_USBDescriptorToSend++;
        }

        // Return data to SIE through buffer descriptor
        _USBBD0I.count = EP0_SIZE;
        _USBBD0I.status = _USBBD0I.status^DTS;                // Toggle the DATAx bit
        _USBBD0I.status = (_USBBD0I.status&DTS)|(UOWN|DTSEN); // Preserve DATAx, clear rest, set UOWN and DTSEN

        // Inform IN token processing to keep sending descriptor
        _USBEngineStatus |= USBEngineStatusSendingDescriptor;
        _USBDescriptorBytesLeft -= EP0_SIZE;
    }
}

void _USBWriteDescriptor(rom const unsigned char *descriptor, unsigned char bytes)
{
    // Simply setup system for global descriptor-sending function
    _USBDescriptorToSend = descriptor;
    _USBDescriptorBytesLeft = bytes;

    // Call the function that sends the first set of EP0_SIZE bytes
    _USBSendDescriptor();
}

void _USBWriteSingleDescriptor(rom const unsigned char *descriptor)
{
    _USBWriteDescriptor(descriptor, descriptor[bLength_OFFSET]);
}

void _USBProcessEP0(void)
{
    unsigned char *UEP;
    unsigned char n;
    USBBufferDescriptor *currentBufferDescriptor;

    unsigned char *transactionData;
    USBToken transactionToken;
    unsigned char bRequest;
    unsigned char bmRequestType;
    unsigned wValue;
    unsigned wIndex;

    transactionData = gCurrentBufferDescriptor.address;
    transactionToken = (gCurrentBufferDescriptor.status&0x3C)>>2;

    switch (transactionToken) {  // extract PID bits
        case USBTokenSETUP:
            // SETUP token processing
            bRequest = transactionData[bRequest_OFFSET];
            bmRequestType = transactionData[bmRequestType_OFFSET];
            wValue = transactionData[wValueL_OFFSET] + (transactionData[wValueH_OFFSET])*0x100;
            wIndex = transactionData[wIndexL_OFFSET] + (transactionData[wIndexH_OFFSET])*0x100;
            
            // Reset OUT endpoint, dequeue any IN packets, and re-enable packet transfers
            _USBBD0O.status = ((!(bmRequestType&HOST_TO_DEVICE)&&wValue) ? (UOWN|DTS|DTSEN) : (UOWN|DTSEN)); // Choose correct DATA0/DATA1
            _USBBD0O.count = EP0_SIZE;
            _USBBD0I.status = DTSEN;   // steal UOWN to dequeue IN packets
            UCONbits.PKTDIS = 0;
            _USBEngineStatus = USBEngineStatusReset;
            
            // Move more up after testing/commit. The above is a combination of my code and Brad Minch's.
            switch (bRequest) {
                case GET_STATUS:
                    switch (bmRequestType) {
                        case USB_DEVICE_REQUEST:
                            _USBWriteValue(_USBDeviceStatus, 2);
                            break;

                        case USB_INTERFACE_REQUEST:
                            if ((_USBDeviceState == USBDeviceStateConfigured) && (wIndex<NUMBER_OF_USB_INTERFACES)) {
                                _USBWriteValue(0, 2);   // Always 0
                            } else {
                                _USBHandleControlError();
                            }
                            break;

