taylortrimble/pic18usb/USBFramework.c
                        case USB_ENDPOINT_REQUEST:
                            // Caluculate buffer descriptor status register and move BSTALL bit to bit <0>
                            if (_USBDeviceState == USBDeviceStateAddressed) {
                                _USBWriteValue((*(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04))&BSTALL)>>2, 2);
                            } else if (_USBDeviceState == USBDeviceStateConfigured) {
                                if (*(&UEP0+(wIndex&0x000F)) & (wIndex&0x80?EPINEN:EPOUTEN)) {  // If endpoint is enabled in specified directiong
                                    _USBWriteValue((*(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04))&BSTALL)>>2, 2);
                                } else {
                                    _USBResetEP0InBuffer();
                                }
                            } else {
                                _USBResetEP0InBuffer();
                            }
                            break;

                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                case CLEAR_FEATURE:
                    switch (bmRequestType) {
                        case USB_DEVICE_REQUEST:
                            switch (wValue) {
                                case DEVICE_REMOTE_WAKEUP:
                                    _USBDeviceStatus &= ~USBDeviceStatusDeviceRemoteWakeup;
                                    _USBResetEP0InBuffer();
                                    break;

                                case TEST_MODE:
                                    _USBDeviceStatus &= ~USBDeviceStatusTestMode;
                                    _USBResetEP0InBuffer();
                                    break;

                                default:
                                    _USBHandleControlError();
                                    break;
                            }
                            break;

                        case USB_ENDPOINT_REQUEST:
                            if (_USBDeviceState == USBDeviceStateAddressed) {
                                _USBResetEP0InBuffer();
                            } else if (_USBDeviceState == USBDeviceStateConfigured) {
                                if (*(&UEP0+(wIndex&0x000F)) & (wIndex&0x80?EPINEN:EPOUTEN)) {  // If endpoint is enabled in specified directiong
                                    *(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04)) = 0x00; // Clear endpoint descriptor
                                } else {
                                    _USBResetEP0InBuffer();
                                }
                            } else {
                                _USBHandleControlError();
                            }
                            break;

                        case USB_INTERFACE_REQUEST: // Should never happen
                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                    
                case SET_FEATURE:
                    switch (bmRequestType) {
                        case USB_DEVICE_REQUEST:
                            switch (wValue) {
                                case DEVICE_REMOTE_WAKEUP:
                                    _USBDeviceStatus |= USBDeviceStatusDeviceRemoteWakeup;
                                    _USBResetEP0InBuffer();
                                    break;

                                case TEST_MODE:
                                    _USBDeviceStatus |= USBDeviceStatusTestMode;
                                    _USBResetEP0InBuffer();
                                    break;

                                default:
                                    _USBHandleControlError();
                                    break;
                            }
                            break;

                        case USB_ENDPOINT_REQUEST:
                            if (_USBDeviceState == USBDeviceStateAddressed) {
                                _USBResetEP0InBuffer();
                            } else if (_USBDeviceState == USBDeviceStateConfigured) {
                                if (*(&UEP0+(wIndex&0x000F)) & (wIndex&0x80?EPINEN:EPOUTEN)) {  // If endpoint is enabled in specified directiong
                                    *(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04)) = (UOWN|BSTALL);    // Stall endpoint
                                } else {
                                    _USBResetEP0InBuffer();
                                }
                            } else {
                                _USBHandleControlError();
                            }
                            break;

                        case USB_INTERFACE_REQUEST: // Should never happen
                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                case SET_ADDRESS:
                    // Device only
                    if (wValue <= 127) {
                        _USBEngineStatus |= USBEngineStatusAddressing;
                        _USBPendingDeviceAddress = wValue;
                        _USBResetEP0InBuffer();
                    } else {
                        _USBHandleControlError();
                    }
                    break;

                case GET_DESCRIPTOR:
                    // Device only (bmRequestType)
                    switch ((wValue>>8)&0x00FF) { // High byte contains descriptor type
                        case DEVICE:
                            _USBWriteSingleDescriptor(_USBDeviceDescriptor);
                            break;
                        case CONFIGURATION:
                            _USBWriteDescriptor(_USBConfigurationDescriptors[wValue&0x00FF], (_USBConfigurationDescriptors[wValue&0x00FF])[wTotalLengthL_OFFSET]+((_USBConfigurationDescriptors[wValue&0x00FF])[wTotalLengthH_OFFSET])*0x100);
                            break;
                        case STRING:
                            _USBWriteSingleDescriptor(_USBStringDescriptors[wValue]);
                            break;
                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                case GET_CONFIGURATION:
                    // Device only
                    _USBWriteValue(_USBCurrentConfiguration, 1);
                    break;
                case SET_CONFIGURATION:
                    // Device only
                    if (wValue <= NUMBER_OF_CONFIGURATIONS) {
                        _USBCurrentConfiguration = wValue;
                        // Disable all endpoints except 0
#warning must update so that other endpoints are to work later
                        UEP1 = 0x00;
                        UEP2 = 0x00;
                        UEP3 = 0x00;
                        UEP4 = 0x00;
                        UEP5 = 0x00;
                        UEP6 = 0x00;
                        UEP7 = 0x00;
                        if (_USBCurrentConfiguration == 0) {
                            _USBDeviceState |= USBDeviceStateAddressed;
                            LATC = 0b0100;
                        } else {
                            _USBDeviceState = USBDeviceStateConfigured;
                            LATC = 0b1000;
                        }
                        _USBResetEP0InBuffer();
                    } else {
                        _USBHandleControlError();
                    }
                    break;
                case GET_INTERFACE:
                    // Interface only
                    if ((_USBDeviceState == USBDeviceStateConfigured) && (wIndex < NUMBER_OF_USB_INTERFACES)) {
                        if (wValue == 0) {  // Only support bAlternateSetting of 0 for EP0
                            _USBWriteValue(0, 1);
                        } else {
                            _USBHandleControlError();
                        }
                    } else {
                        _USBHandleControlError();
                    }
                    break;

                case SET_INTERFACE:
                    // Interface only
                    if ((_USBDeviceState == USBDeviceStateConfigured) && (wIndex < NUMBER_OF_USB_INTERFACES)) {
                        if (wValue == 0) {  // Only support bAlternateSetting of 0 for EP0
                            _USBResetEP0InBuffer();
                        } else {
                            _USBHandleControlError();
                        }
                    } else {
                        _USBHandleControlError();
                    }
                    break;
                case SET_DESCRIPTOR:    // Useless
                case SYNCH_FRAME:       // Unused
                default:
                    _USBHandleControlError();
                    break;
            }
            break;
        case USBTokenIN:
            // A pending USB address is committed on an IN token
            if (_USBEngineStatus & USBEngineStatusAddressing) {
                UADDR = _USBPendingDeviceAddress;
                switch (UADDR) {
                    case 0:
                        _USBDeviceState |= USBDeviceStateInitialized;
                        UPDATE_ENUM_STATUS(_USBDeviceState);
                        break;
                        
                    default:
                        _USBDeviceState = USBDeviceStateAddressed;
                        UPDATE_ENUM_STATUS(_USBDeviceState);
                        break;
                }
                _USBEngineStatus &= ~USBEngineStatusAddressing;
            }
            
            // Continue sending any unfinished descriptor transmission
            else if (_USBEngineStatus & USBEngineStatusSendingDescriptor) {
                _USBSendDescriptor();
            }
            break;
        case USBTokenOUT:
            // Any OUT token means no more IN tokens are necessary
            _USBResetEP0InBuffer();
            
